import 'package:get/get_navigation/src/root/internacionalization.dart';

class AppTranslation extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        ///////////////////////////// Language /////////////////////////
        "ar": {
          /////////////Welcome/////////////
          "1-مرحبًا في تطبيق كرز": "مرحبًا في تطبيق كرز",
          "2-سهولة في الطلب..فنيين بأعلى كفاءة ممكنة..وجودة مميزة":
              "سهولة في الطلب..فنيين بأعلى كفاءة ممكنة..وجودة مميزة",
          "3-تسجيل الدخول": "تسجيل الدخول",
          "4-المتابعة كزائر": "المتابعة كزائر",

          //////////////////////..............viewMainTypes............../////////
          "5-لايوجد بيانات": "لايوجد بيانات",
          "6-يتم التحميل": "يتم التحميل",

          //////////////////.......................MenuList........................................
          "7-الرئيسية": "الرئيسية",
          "8-الطلبيات": "الطلبيات",
          "9-التنبيهات": "التنبيهات",
          "10-الاعدادت": "الاعدادت",

          /////////////////..................Sub Types................/////////////////////
          "11-لايوجد بيانات لهذا القسم": "لايوجد بيانات لهذا القسم",
          //////////////////////////////...................Settings.................//////////////
          "12-الإعدادت": "الإعدادت",
          "13-معلومات الحساب": "معلومات الحساب",
          "14-الطلبيات": "الطلبيات",
          "15-موقعي": "موقعي",
          "16-التنبيهات": "التنبيهات",
          "17-معلومات حول كرز": "معلومات حول كرز",
          "18-تسجيل خروج": "تسجيل خروج",
          "19-حذف الحساب": "حذف الحساب",
          ////////////...........About Location........../////////////////////
          "20-الموقع والعمليات": "الموقع والعمليات",
          "21-يتم أخذ موقعك الحالي على الخريطة بشكل تلقائي وحفظه للقيام بعمليات الخدمة":
              "يتم أخذ موقعك الحالي على الخريطة بشكل تلقائي وحفظه للقيام بعمليات الخدمة",
          "22-إظهار موقعك": "إظهار موقعك",
          "23-تغيير الموقع": "تغيير الموقع",
          "24-انتظر قليلاً..يتم التحقق وأخذ الموقع الان":
              "انتظر قليلاً..يتم التحقق وأخذ الموقع الان",
          "25-هنالك خطأ...!": "هنالك خطأ...!",
          "26-خدمة -موقعي- غير مفعلة على جهازك..قم بتفعيلها ثم أعد المحاولة":
              "خدمة -موقعي- غير مفعلة على جهازك..قم بتفعيلها ثم أعد المحاولة",

          ////////////////////////////.............Get Location..................///////////
          "27-تحديد موقعك على الخريطة": "تحديد موقعك على الخريطة",
          "28-يتم أخذ موقعك الحالي على الخريطة بشكل تلقائي وحفظه للقيام بعمليات الخدمة":
              "يتم أخذ موقعك الحالي على الخريطة بشكل تلقائي وحفظه للقيام بعمليات الخدمة",
          "29-أخذ موقعك الان": "أخذ موقعك الان",
          "30-يتم حذف موقعك حال حذف الحساب..لايتم إستغلال الموقع او أرشفته او تخزين في سيرفرات تخزين خارجية":
              "يتم حذف موقعك حال حذف الحساب..لايتم إستغلال الموقع او أرشفته او تخزين في سيرفرات تخزين خارجية",
          "31-انتظر قليلاً..يتم التحقق وأخذ الموقع الان":
              "انتظر قليلاً..يتم التحقق وأخذ الموقع الان",
          "32-هنالك خطأ...!": "هنالك خطأ...!",
          "33-خدمة -موقعي- غير مفعلة على جهازك..قم بتفعيلها ثم أعد المحاولة":
              "خدمة -موقعي- غير مفعلة على جهازك..قم بتفعيلها ثم أعد المحاولة",
          "34-لقد قمت برفض عملية التحصل على موقعك بشكل تلقائي..قم بالسماح للوصول لموقعك":
              "لقد قمت برفض عملية التحصل على موقعك بشكل تلقائي..قم بالسماح للوصول لموقعك",
          "35-انتهت العملية": "انتهت العملية",
          "36-لقد تم أخذ موقعك بنجاح": "لقد تم أخذ موقعك بنجاح",
          "37-مشاهدة الموقع الان": "الاخفاء الان",

          //////////////////////////////////////..........Info Accounts....................//////////////
          "38-معلومات الحساب": "معلومات الحساب",
          "39-اسم المستخدم:": "اسم المستخدم:",
          "40-رقم الهاتف:": "رقم الهاتف:",

          //////////////////////////...................Orders List............////////////
          "40-قائمة طلبياتك": "قائمة طلبياتك",
          "41-لاتمتلك اي طلبيات لعرضها": "لاتمتلك اي طلبيات لعرضها",
          "42-نوع الخدمة:": "نوع الخدمة:",
          "43-رقم هذة الطلبية:": "رقم هذة الطلبية:",
          "44-إجمالي سعر هذة الطلبية:": "إجمالي سعر هذة الطلبية:",
          "45-لم يتم الإنتهاء من الطلبية بعد": "لم يتم الإنتهاء من الطلبية بعد",
          "46-انهيت تاكيد الطلبية شاهد التفاصيل الان":
              "انهيت تاكيد الطلبية شاهد التفاصيل الان",
          "47-تاكيد الطلبية": "تاكيد الطلبية",
          "48-مشاهدة التفاصيل": "مشاهدة التفاصيل",

          //////////////////////////////////.............About Services...................//////////////
          "49-عدد تفرعات الخدمة التي طلبتها:": "عدد تفرعات الخدمة التي طلبتها:",
          "50-خدمة حتى الان": "خدمة حتى الان",
          "51-إجمالي سعر الخدمة وتفرعاتها:": "إجمالي سعر الخدمة وتفرعاتها:",
          "52-طلب الخدمة": "طلب الخدمة",
          "53-ملاحظة:يتم إضافة الخدمة في قائمة -الطلبيات- بشكل معلق عليك إكمال الإجراءت الطلب والجدولة":
              "ملاحظة:يتم إضافة الخدمة في قائمة -الطلبيات- بشكل معلق عليك إكمال الإجراءت الطلب والجدولة",
          "54-أنتظر قليلاً..يتم إضافة الطلبية":
              "أنتظر قليلاً..يتم إضافة الطلبية",

          ///////////////////.......................Show Location....................///////////
          "55-موقعك على الخريطة": "موقعك على الخريطة",
          //////////////////////..............Choose Language.......................////////////////
          "56-عزيزي العميل..يتم أخذ لغه التطبيق الرئيسي عن طريق إستخدام لغة جهازك المُعتمدة في حال أردت تغيير اللغة أختر أحد الخيارات المتاحة":
              "عزيزي العميل..يتم أخذ لغه التطبيق الرئيسي عن طريق إستخدام لغة جهازك المُعتمدة في حال أردت تغيير اللغة أختر أحد الخيارات المتاحة",

          "56-اللغة العربية-الأختيار": "اللغة العربية-الأختيار",
          "57-اللغة الانجليزية-الأختيار": "اللغة الانجليزية-الأختيار",
          "58-الإنتقال": "الإنتقال",

          /////////////////////...........................OrdersConfirmation............//////////

          "59-عملية تاكيد الطلبية": "عملية تاكيد الطلبية",
          "60-التفاصيل العامة": "التفاصيل العامة",
          "61-نوع الخدمة:": "نوع الخدمة:",
          "62-رقم الطلبية:": "رقم الطلبية:",
          "63-إجمالي الطلبية:": "إجمالي الطلبية:",
          "64-تفاصيل أنواع الخدمة المقدمة": "تفاصيل أنواع الخدمة المقدمة",
          "65-لاتمتلك اي تفرعات لعرضها": "لاتمتلك اي تفرعات لعرضها",
          "66-عملية الجدولة": "عملية الجدولة",
          "67-قم بجدولة الخدمة..أختار التاريخ والوقت المناسبين لك عن طريق الخيارات التالية":
              "قم بجدولة الخدمة..أختار التاريخ والوقت المناسبين لك عن طريق الخيارات التالية",
          "68-إختيار تاريخ": "إختيار تاريخ",
          "69-التاريخ المُدخل:": "التاريخ المُدخل:",
          "70-إختيار الوقت": "إختيار الوقت",
          "71-الوقت المُدخل:": "الوقت المُدخل:",
          "72-آلية الدفع": "آلية الدفع",
          "73-دفع نقدي-كاش": "دفع نقدي-كاش",
          "74-إختيار هذه الآلية": "إختيار هذه الآلية",
          "75-دفع إلكتروني-عبر البطاقة": "دفع إلكتروني-عبر البطاقة",
          "76-إختيار هذه الآلية": "إختيار هذه الآلية",
          "77-موقعك": "موقعك",
          "78-هذا موقعك الذي سيتم تقديم الخدمة فيه-اضغط على الزر لرؤية الموقع-":
              "هذا موقعك الذي سيتم تقديم الخدمة فيه-اضغط على الزر لرؤية الموقع-",
          "79-مشاهدة موقعك": "مشاهدة موقعك",
          "80-هل هنالك خطا في موقعك؟ تستطيع تغيير موقعك من خلال الذهاب إلى الاعدادت-موقعي-تغيير الموقع":
              "هل هنالك خطا في موقعك؟ تستطيع تغيير موقعك من خلال الذهاب إلى الاعدادت-موقعي-تغيير الموقع",
          "80-تفاصيل أخرى": "تفاصيل أخرى",
          "81-إضافة تفاصيل اخرى مهمة علينا معرفتها -اكتب ماتريد هنا-":
              "إضافة تفاصيل اخرى مهمة علينا معرفتها -اكتب ماتريد هنا-",
          "82-إضافة صورة توضيحية:": "إضافة صورة توضيحية:",
          "83-تم رفع الصورة": "تم رفع الصورة",
          "84-رفع صورة": "رفع صورة",
          "85-الإنهاء": "الإنهاء",
          "86-قم بإنهاء العملية الان إما للتاكيد الطلبية من أجل القيام بها..او إلغاء الطلبية":
              "قم بإنهاء العملية الان إما للتاكيد الطلبية من أجل القيام بها..او إلغاء الطلبية",
          "87-الالغاء": "الالغاء",
          "88-التاكيد الان": "التاكيد الان",
          "89-التاكيد": "التاكيد",
          "90-جدول وقتي مرن": "جدول وقتي مرن",
          "91-جدول وقتي محدد": "جدول وقتي محدد",
          "92-الاوقات المحددة  للقيام بعمليات الخدمة..أختر الوقت المناسب لك...":
              "الاوقات المحددة  للقيام بعمليات الخدمة..أختر الوقت المناسب لك...",
          "93-مختار": "مختار",
          "94-التاكيد-الإخفاء": "التاكيد-الإخفاء",
          "95-الاوقات المرنة المتوفرة للقيام بعمليات الخدمة..أختر الوقت المناسب لك...":
              "الاوقات المرنة المتوفرة للقيام بعمليات الخدمة..أختر الوقت المناسب لك...",
          "96-وقت صباحي 8-12 ظهرًا": "وقت صباحي 8-12 ظهرًا",
          "96-الاختيار": "الاختيار",
          "97-توقيت صباحي 10صباحًا-2 ظهرًا": "توقيت صباحي 10صباحًا-2 ظهرًا",
          "98-توقيت عصري 12-4 عصرًا": "توقيت عصري 12-4 عصرًا",
          "99-توقيت عصري 2-6 عصرًا": "توقيت عصري 2-6 عصرًا",
          "100-توقيت مسائي 4-8 مساءاً": "توقيت مسائي 4-8 مساءاً",
          "101-توقيت مسائي 6-10 مساءاً": "توقيت مسائي 6-10 مساءاً",
          "102-لم يتم إختيار اي جدول زمني قم بإختيار زمن جدولي":
              "لم يتم إختيار اي جدول زمني قم بإختيار زمن جدولي",

          ////////////////////////////////////....................OrdersDetails/////////////////////
          "103-التفاصيل النهائية للطلبية": "التفاصيل النهائية للطلبية",
          "104-هذه هي الجدولة التى قمت بإختيارها..في حال وُجد اي تغيير سيتم إشعارك بوقت مناسب لذلك":
              "هذه هي الجدولة التى قمت بإختيارها..في حال وُجد اي تغيير سيتم إشعارك بوقت مناسب لذلك",
          "105-تاريخ الجدولة المُدخل:": "تاريخ الجدولة المُدخل:",
          "106-وقت الجدولة المُدخل:": "وقت الجدولة المُدخل:",
          "107-هذة الألية المُختارة لعملية الدفع مقابل الخدمة":
              "هذة الألية المُختارة لعملية الدفع مقابل الخدمة",
          "108-آلية الدفع المُختارة:": "آلية الدفع المُختارة:",
          "109-دفع كاش-نقدي": "دفع كاش-نقدي",
          "110-دفع عبر البطاقة-إلكتروني": "دفع عبر البطاقة-إلكتروني",
          "111-التفاصيل الإضافية(نص مُدخل-صورة مُدخلة) حسب الرغبة":
              "التفاصيل الإضافية(نص مُدخل-صورة مُدخلة) حسب الرغبة",
          //////////////////////////................Auth........................../////////////
          ///////////////////////SignUp...................../
          "140-مرحبًا بك..صفحة إنشاء الحساب": "مرحبًا بك..صفحة إنشاء الحساب",
          "141-قم بإدخال رقمك..سيتم التحقق من الرقم عبر إرسال رسالة نصية تحتوي على رمز التحقق":
              "قم بإدخال رقمك..سيتم التحقق من الرقم عبر إرسال رسالة نصية تحتوي على رمز التحقق",
          "142-رقم الهاتف": "رقم الهاتف",
          "143-رجاءًا..قم بإدخال رقم الهاتف": "رجاءًا..قم بإدخال رقم الهاتف",
          "144-قيم فارغة": "قيم فارغة",
          "145-عليك التقيد بالعدد المسموح": "عليك التقيد بالعدد المسموح",
          "146-في حال تسجيلك فإنك توافق على شروط وأحكام تطبيق كرز-إننا لانقوم بإستغلال الرقم لاي أغراض خارجية":
              "في حال تسجيلك فإنك توافق على شروط وأحكام تطبيق كرز-إننا لانقوم بإستغلال الرقم لاي أغراض خارجية",
          "147-التحقق الان": "التحقق الان",
          "148-لديك حساب بالفعل؟ قم بتسجيل الدخول-اضغط هنا-":
              "لديك حساب بالفعل؟ قم بتسجيل الدخول-اضغط هنا-",
          "149-انتظر قليلًا..يتم التحقق وإرسال الرمز":
              "انتظر قليلًا..يتم التحقق وإرسال الرمز",
          "150-صفحة التحقق من الرمز": "صفحة التحقق من الرمز",
          "151-قم بإدخال رمز التحقق المُرسل إلى رقم هاتفك المُدخل بالاسفل":
              "قم بإدخال رمز التحقق المُرسل إلى رقم هاتفك المُدخل بالاسفل",
          "152-رقم هاتفك المُدخل:": "رقم هاتفك المُدخل:",
          "153-كود التحقق": "كود التحقق",
          "154-أدخل كود التحقق هنا": "أدخل كود التحقق هنا",
          "155-المتابعة": "المتابعة",
          "156-لم يصلك الرمز؟ قم بطلب رمز التحقق مُجددًا -اضغط هنا للطلب-":
              "لم يصلك الرمز؟ قم بطلب رمز التحقق مُجددًا -اضغط هنا للطلب-",
          "157-أنتظر قليلاً إننا نقوم بالتحقق من الرقم":
              "أنتظر قليلاً إننا نقوم بالتحقق من الرقم",
          "158-لقد أنهيت عملية التحقق من الرقم..رجاءًا قم بإدخال أسمك لإنهاء عملية تسجيل الحساب":
              "لقد أنهيت عملية التحقق من الرقم..رجاءًا قم بإدخال أسمك لإنهاء عملية تسجيل الحساب",
          "159-الاسم": "الاسم",
          "160-رجاءًا..قم بإدخال اسمك": "رجاءًا..قم بإدخال اسمك",
          "161-الإنشاء الان": "الإنشاء الان",
          "162-يتم الحفظ والتوجه الان": "يتم الحفظ والتوجه الان",
          "163-ليس لديك حساب  قم بإنشاء حساب الان-اضغط هنا-":
              "ليس لديك حساب  قم بإنشاء حساب الان-اضغط هنا-",

          "164-تمت إضافة الطلبية بنجاح..قم بإكمال الإجراءات في -قسم الطلبيات":
              "تمت إضافة الطلبية بنجاح..قم بإكمال الإجراءات في -قسم الطلبيات",

          /////////////////////No Messages.......................//////////////
          "165-ليس لديك حساب..لايمكنك القيام بهذة العملية":
              "ليس لديك حساب..لايمكنك القيام بهذة العملية",
          "166-الاخفاء": "الاخفاء",
          "167-تسجيل الدخول": "تسجيل الدخول",

          ////////////////////Menu more tra..///////////////
          "168-اللغة": "اللغة",
          "169-هل أنت متأكد برغبتك بحذف الحساب؟ لايمكن التراجع بعد عملية حذف الحساب":
              "هل أنت متأكد برغبتك بحذف الحساب؟ لايمكن التراجع بعد عملية حذف الحساب",
          "170-ملاحظة:لايمكن حذف الحساب حال تاكيد طلبية ما ..عليك إنهاء إجراءات طلب الطلبية ثم حذف الحساب":
              "ملاحظة:لايمكن حذف الحساب حال تاكيد طلبية ما ..عليك إنهاء إجراءات طلب الطلبية ثم حذف الحساب",
          "171-حذف الحساب الان": "حذف الحساب الان",

          ///////////Order confirmation more..........///////
          "172-يتم تاكيد الطلبية لهذة الخدمة..الرجاء الإنتظار":
              "يتم تاكيد الطلبية لهذة الخدمة..الرجاء الإنتظار",
          "173-تم تاكيد الطلبية والعملية بنجاح..سيتم تقديم الخدمة في الجدولة المُختارة..الرجاء تتبع الرسائل لمشاهدة المستجدات":
              "تم تاكيد الطلبية والعملية بنجاح..سيتم تقديم الخدمة في الجدولة المُختارة..الرجاء تتبع الرسائل لمشاهدة المستجدات",

          /////////////////Messages.............////////////////

          "175-قائمة رسائلك والتنبيهات": "قائمة رسائلك والتنبيهات",
          "176-لاتمتلك اي رسائل لعرضها": "لاتمتلك اي رسائل لعرضها",
        },

        "en": {
          /////////////Welcome/////////////
          "1-مرحبًا في تطبيق كرز": "Welcome to the Karaz application",
          "2-سهولة في الطلب..فنيين بأعلى كفاءة ممكنة..وجودة مميزة":
              "Ease of ordering... technicians with the highest possible efficiency... and outstanding quality.",
          "3-تسجيل الدخول": "Sign In",
          "4-المتابعة كزائر": "Continue as guest",

          //////////////////////..............viewMainTypes............../////////
          "5-لايوجد بيانات": "There are no data",

          "6-يتم التحميل": "loading",

          //////////////////.......................MenuList........................................
          "7-الرئيسية": "Home",
          "8-الطلبيات": "Orders",
          "9-التنبيهات": "Alerts",
          "10-الاعدادت": "Settings",

          /////////////////..................Sub Types................/////////////////////
          "11-لايوجد بيانات لهذا القسم": "There is no data for this section",
          //////////////////////////////...................Settings.................//////////////
          "12-الإعدادت": "Settings",
          "13-معلومات الحساب": "Account Information",
          "14-الطلبيات": "Orders",
          "15-موقعي": "Location",
          "16-التنبيهات": "Alerts",
          "17-معلومات حول كرز": "Information about Karaz",
          "18-تسجيل خروج": "Log out",
          "19-حذف الحساب": "delete account",
          ////////////...........About Location........../////////////////////
          "20-الموقع والعمليات": "Location and Operations",
          "21-يتم أخذ موقعك الحالي على الخريطة بشكل تلقائي وحفظه للقيام بعمليات الخدمة":
              "Your current location on the map is automatically taken and saved for service operations.",
          "22-إظهار موقعك": "Show your location",
          "23-تغيير الموقع": "change location",
          "24-انتظر قليلاً..يتم التحقق وأخذ الموقع الان":
              "Wait a little while...the location is being verified and taken now.",
          "25-هنالك خطأ...!": "There is an error...!",
          "26-خدمة -موقعي- غير مفعلة على جهازك..قم بتفعيلها ثم أعد المحاولة":
              "My Location” service is not activated on your device. Activate it and try again.",

          ////////////////////////////.............Get Location..................///////////
          "27-تحديد موقعك على الخريطة": "Locate your location on the map",
          "28-يتم أخذ موقعك الحالي على الخريطة بشكل تلقائي وحفظه للقيام بعمليات الخدمة":
              "Your current location on the map is automatically taken and saved for service operations.",
          "29-أخذ موقعك الان": "Take your Location now",
          "30-يتم حذف موقعك حال حذف الحساب..لايتم إستغلال الموقع او أرشفته او تخزين في سيرفرات تخزين خارجية":
              "Your site will be deleted once the account is deleted. The site will not be exploited, archived, or stored in external storage servers.",
          "31-انتظر قليلاً..يتم التحقق وأخذ الموقع الان":
              "Wait a little...the location is being verified and taken now.",
          "32-هنالك خطأ...!": "There is an error...!",
          "33-خدمة -موقعي- غير مفعلة على جهازك..قم بتفعيلها ثم أعد المحاولة":
              "My location service is not activated on your device. Activate it and try again.",
          "34-لقد قمت برفض عملية التحصل على موقعك بشكل تلقائي..قم بالسماح للوصول لموقعك":
              "You have denied the process of accessing your site automatically. Allow access to your Location.",
          "35-انتهت العملية": "Operation finished",
          "36-لقد تم أخذ موقعك بنجاح":
              "Your location has been successfully taken",
          "37-مشاهدة الموقع الان": "Hide Now",

          //////////////////////////////////////..........Info Accounts....................//////////////
          "38-معلومات الحساب": "Account Information",
          "39-اسم المستخدم:": "user name:",
          "40-رقم الهاتف:": "phone number:",

          //////////////////////////...................Orders List............////////////
          "40-قائمة طلبياتك": "Your order list",
          "41-لاتمتلك اي طلبيات لعرضها": "You don't have any orders to display",
          "42-نوع الخدمة:": "service type:",
          "43-رقم هذة الطلبية:": "This order number:",
          "44-إجمالي سعر هذة الطلبية:": "Total price for this order:",
          "45-لم يتم الإنتهاء من الطلبية بعد":
              "The order has not been completed yet",
          "46-انهيت تاكيد الطلبية شاهد التفاصيل الان":
              "you finished confirming the order",
          "47-تاكيد الطلبية": "Confirm order",
          "48-مشاهدة التفاصيل": "View details",

          //////////////////////////////////.............About Services...................//////////////
          "49-عدد تفرعات الخدمة التي طلبتها:":
              "Number of branches of the service you requested:",
          "50-خدمة حتى الان": "Service",
          "51-إجمالي سعر الخدمة وتفرعاتها:":
              "Total price of the service and its branches:",
          "52-طلب الخدمة": "Service Request",
          "53-ملاحظة:يتم إضافة الخدمة في قائمة -الطلبيات- بشكل معلق عليك إكمال الإجراءت الطلب والجدولة":
              "Note: The service is added to the order list on a pending basis. You must complete the ordering and scheduling procedures.",
          "54-أنتظر قليلاً..يتم إضافة الطلبية":
              "Wait a little...the order is being added.",

          ///////////////////.......................Show Location....................///////////
          "55-موقعك على الخريطة": "Your location on the map",
          //////////////////////..............Choose Language.......................////////////////
          "56-عزيزي العميل..يتم أخذ لغه التطبيق الرئيسي عن طريق إستخدام لغة جهازك المُعتمدة في حال أردت تغيير اللغة أختر أحد الخيارات المتاحة":
              "Dear customer, the language of the main application is taken by using your device’s approved language. If you want to change the language, choose one of the available options.",

          "56-اللغة العربية-الأختيار": "Arabic language - choose",
          "57-اللغة الانجليزية-الأختيار": "English language - choose",
          "58-الإنتقال":
              "Move Now", /////////////////////...........................OrdersConfirmation............//////////

          "59-عملية تاكيد الطلبية": "Order confirmation process",
          "60-التفاصيل العامة": "General Details",
          "61-نوع الخدمة:": "service type:",
          "62-رقم الطلبية:": "Order number:",
          "63-إجمالي الطلبية:": "Total order:",
          "64-تفاصيل أنواع الخدمة المقدمة":
              "Details of the types of service provided",
          "65-لاتمتلك اي تفرعات لعرضها":
              "You don't have any branches to display",
          "66-عملية الجدولة": "Scheduling process",
          "67-قم بجدولة الخدمة..أختار التاريخ والوقت المناسبين لك عن طريق الخيارات التالية":
              "Schedule the service...choose the date and time that suits you through the following options",
          "68-إختيار تاريخ": "Choose date",
          "69-التاريخ المُدخل:": "Date entered:",
          "70-إختيار الوقت": "Choose time",
          "71-الوقت المُدخل:": "Entered time:",
          "72-آلية الدفع": "Payment Type",
          "73-دفع نقدي-كاش": "Cash payment",
          "74-إختيار هذه الآلية": "Choose this type",
          "75-دفع إلكتروني-عبر البطاقة": "Electronic payment via card",
          "76-إختيار هذه الآلية": "Choose this type",
          "77-موقعك": "Location",
          "78-هذا موقعك الذي سيتم تقديم الخدمة فيه-اضغط على الزر لرؤية الموقع-":
              "This is your location where the service will be provided - click the button to see the location -",
          "79-مشاهدة موقعك": "Show The Location",
          "80-هل هنالك خطا في موقعك؟ تستطيع تغيير موقعك من خلال الذهاب إلى الاعدادت-موقعي-تغيير الموقع":
              "Is there something wrong with your Location? You can change your Location by going to Settings - My Location - Change Location.",
          "80-تفاصيل أخرى": "other details",
          "81-إضافة تفاصيل اخرى مهمة علينا معرفتها -اكتب ماتريد هنا-":
              "Add other important details that we need to know - write what you want here -",
          "82-إضافة صورة توضيحية:": "Add an illustration:",
          "83-تم رفع الصورة": "Image has been uploaded",
          "84-رفع صورة": "Upload a Image",
          "85-الإنهاء": "End The Order",
          "86-قم بإنهاء العملية الان إما للتاكيد الطلبية من أجل القيام بها..او إلغاء الطلبية":
              "End the process now, either to confirm the order in order to place it...or cancel the order.",
          "87-الالغاء": "Cancel",
          "88-التاكيد الان": "Confirm now",
          "89-التاكيد": "Confirm",
          "90-جدول وقتي مرن": "Flexible schedule",
          "91-جدول وقتي محدد": "specific schedule",
          "92-الاوقات المحددة  للقيام بعمليات الخدمة..أختر الوقت المناسب لك...":
              "Specific times for carrying out service operations...Choose the time that suits you...",

          "93-مختار": "selected",
          "94-التاكيد-الإخفاء": "Confirm-Conceal",
          "95-الاوقات المرنة المتوفرة للقيام بعمليات الخدمة..أختر الوقت المناسب لك...":
              "Flexible times available to carry out service operations...Choose the time that suits you...",

          "96-وقت صباحي 8-12 ظهرًا": "Morning time 8-12 noon",
          "96-الاختيار": "select",
          "97-توقيت صباحي 10صباحًا-2 ظهرًا": "Morning time 10am-2pm",
          "98-توقيت عصري 12-4 عصرًا": "Modern time 12-4 pm",
          "99-توقيت عصري 2-6 عصرًا": "Eastern time 2-6 PM",
          "100-توقيت مسائي 4-8 مساءاً": "Evening time 4-8 pm",
          "101-توقيت مسائي 6-10 مساءاً": "Evening time 6-10 pm",
          "102-لم يتم إختيار اي جدول زمني قم بإختيار زمن جدولي":
              "No schedule has been selected. Select a schedule time.",

          ////////////////////////////////////....................OrdersDetails/////////////////////
          "103-التفاصيل النهائية للطلبية": "Final details of the order",
          "104-هذه هي الجدولة التى قمت بإختيارها..في حال وُجد اي تغيير سيتم إشعارك بوقت مناسب لذلك":
              "This is the schedule that you chose. If there is any change, you will be notified at an appropriate time.",
          "105-تاريخ الجدولة المُدخل:": "Entered scheduling date:",
          "106-وقت الجدولة المُدخل:": "Entered scheduling time:",
          "107-هذة الألية المُختارة لعملية الدفع مقابل الخدمة":
              "This is the chosen mechanism for the payment process for the service",
          "108-آلية الدفع المُختارة:": "Selected payment Type:",
          "109-دفع كاش-نقدي": "Cash payment",
          "110-دفع عبر البطاقة-إلكتروني": "Payment via card - electronic",
          "111-التفاصيل الإضافية(نص مُدخل-صورة مُدخلة) حسب الرغبة":
              "Additional details (entered text - entered image) as desired",
          ///////////////////////SignUp...................../
          "140-مرحبًا بك..صفحة إنشاء الحساب": "Welcome...Create New Account ",
          "141-قم بإدخال رقمك..سيتم التحقق من الرقم عبر إرسال رسالة نصية تحتوي على رمز التحقق":
              "Enter your number. The number will be verified by sending a text message containing a verification code.",
          "142-رقم الهاتف": "Your Number",
          "143-رجاءًا..قم بإدخال رقم الهاتف":
              "Please...enter your phone number",

          "144-قيم فارغة": "Empty",
          "145-عليك التقيد بالعدد المسموح":
              "You must adhere to the permitted number.",
          "146-في حال تسجيلك فإنك توافق على شروط وأحكام تطبيق كرز-إننا لانقوم بإستغلال الرقم لاي أغراض خارجية":
              "If you register, you agree to the terms and conditions of the Karaz application - we do not exploit the number for any external purposes.",
          "147-التحقق الان": "Verify now",
          "148-لديك حساب بالفعل؟ قم بتسجيل الدخول-اضغط هنا-":
              "Already have an account? Log in - click here -",
          "149-انتظر قليلًا..يتم التحقق وإرسال الرمز": "Wait a moment...",

          "150-صفحة التحقق من الرمز": "Code verification ",
          "151-قم بإدخال رمز التحقق المُرسل إلى رقم هاتفك المُدخل بالاسفل":
              "Enter the verification code sent to your phone number entered below",
          "152-رقم هاتفك المُدخل:": "Your phone number entered:",
          "153-كود التحقق": "the code",
          "154-أدخل كود التحقق هنا": "Enter verification code here",
          "155-المتابعة": "Next",
          "156-لم يصلك الرمز؟ قم بطلب رمز التحقق مُجددًا -اضغط هنا للطلب-":
              "You did not receive the code? send the verification code again -Click here to send-",
          "157-أنتظر قليلاً إننا نقوم بالتحقق من الرقم":
              "Wait a minute, we are verifying the number.",
          "158-لقد أنهيت عملية التحقق من الرقم..رجاءًا قم بإدخال أسمك لإنهاء عملية تسجيل الحساب":
              "You have completed the number verification process. Please enter your name to complete the account registration process.",
          "159-الاسم": "Name",
          "160-رجاءًا..قم بإدخال اسمك": "Please...enter your name",
          "161-الإنشاء الان": "create now",
          "162-يتم الحفظ والتوجه الان": "Save name..wait",
          "163-ليس لديك حساب  قم بإنشاء حساب الان-اضغط هنا-":
              "You do not have an account. Create an account now - click here -",

          "164-تمت إضافة الطلبية بنجاح..قم بإكمال الإجراءات في -قسم الطلبيات":
              "The order has been added successfully. Complete the procedures in the Orders List.",

          /////////////////////No Messages.......................//////////////
          "165-ليس لديك حساب..لايمكنك القيام بهذة العملية":
              "You do not have an account. You cannot do this operation.",
          "166-الاخفاء": "Hide",
          "167-تسجيل الدخول": "Login",

          ////////////////////Menu more tra..///////////////
          "168-اللغة": "Language",
          "169-هل أنت متأكد برغبتك بحذف الحساب؟ لايمكن التراجع بعد عملية حذف الحساب":
              "Are you sure you want to delete the account? It is not possible to undo it after deleting the account.",
          "170-ملاحظة:لايمكن حذف الحساب حال تاكيد طلبية ما ..عليك إنهاء إجراءات طلب الطلبية ثم حذف الحساب":
              "Note: The account cannot be deleted once an order is confirmed. You must complete the order  procedures and then delete the account.",
          "171-حذف الحساب الان": "Delete Account",

          ///////////Order confirmation more..........///////
          "172-يتم تاكيد الطلبية لهذة الخدمة..الرجاء الإنتظار":
              "The order is being confirmed for this service. Please wait.",
          "173-تم تاكيد الطلبية والعملية بنجاح..سيتم تقديم الخدمة في الجدولة المُختارة..الرجاء تتبع الرسائل لمشاهدة المستجدات":
              "The order and process have been confirmed successfully.. The service will be provided in the chosen schedule.. Please follow the messages to see the latest news.",

          /////////////////Messages.............////////////////

          "175-قائمة رسائلك والتنبيهات": "List of your messages",
          "176-لاتمتلك اي رسائل لعرضها": "no messages to display",
        }
      };
}
